// // სინქრონული არსი: კოდი სრულდება თანმიმდევრობით, 
// // ხაზ-ხაზად. თითოეული ოპერაცია ელოდება წინა 
// // ოპერაციის სრულ დასრულებას

// // გამოიყენება მარტივი მათემატიკური გამოთვლებისთვის, ცვლადების მინიჭებისთვის, მონაცემთა სწრაფი ვალიდაციისთვის და ისეთი ლოგიკისთვის,
// //  სადაც ყოველი მომდევნო ნაბიჯი სრულად დამოკიდებულია წინა ნაბიჯის შედეგზე

// // ასინქრონული არსი: ხანგრძლივი ოპერაციები გაშვეულია ფონურ რეჟიმში. კოდი აგრძელებს მუშაობას და ელოდება პასუხს პროცესის 
// // დაბლოკვის გარეშე არ ბლოკავს შემდეგ კოდებს

// // როდის არის სასარგებლო: სერვერთან კომუნიკაციისას მონაცემთა ბაზებთან ან ფაილურ სისტემასთან მუშაობისას, ტაიმერებისას და UI-ის 
// // ისეთი ინტერაქციებისას, სადაც გვინდა გვერდი არ გაშეშედეს


// 1) შექმენით ფუნქცია waitTwoSeconds, რომელიც აბრუნებს ახალ Promise-ს. ამ Promise-მა 2 წამის (setTimeout) შემდეგ წარმატებით უნდა დააბრუნოს (resolve) ტექსტი: "2 წამი გავიდა!".
//  გამოიძახეთ ეს ფუნქცია და მიღებული შედეგი დაბეჭდეთ კონსოლში .then() მეთოდის გამოყენებით.

// 2) შექმენით ფუნქცია checkNumber(num), რომელიც იღებს რიცხვს და აბრუნებს Promise-ს.
// თუ რიცხვი მეტია ან ტოლია 5-ზე, Promise-მა უნდა დააბრუნოს (resolve) ტექსტი: "რიცხვი ნორმალურია!".
// თუ რიცხვი 5-ზე ნაკლებია, Promise-მა უნდა გამოიწვიოს შეცდომა (reject) ტექსტით: "რიცხვი ძალიან პატარაა!".

// 3) შექმენით ფუნქცია doubleAfterDelay(num), რომელიც იღებს რიცხვს, აბრუნებს Promise-ს და 1 წამის შემდეგ აბრუნებს ამ რიცხვს გამრავლებულს 2-ზე (num * 2).



const waitTwoSeconds = () => {
  return new Promise((resolve, reject) => {
    setTimeout(() => {
      resolve("2 წამი გავიდა!");
    }, 2000);
  });
};


waitTwoSeconds().then((result) => console.log(result));


const checkNumber = (num) => {
  return new Promise((resolve, reject) => {
    if (num >= 5) {
      resolve("რიცხვი ნორმალურია!");
    } else {
      reject("რიცხვი ძალიან პატარაა!");
    }
  });
};

checkNumber(7).then((msg) => console.log(msg)).catch((err) => console.error(err));

checkNumber(3).then((msg) => console.log(msg)).catch((err) => console.error(err));

const doubleAfterDelay = (num) => {
  return new Promise((resolve) => {
    setTimeout(() => {
      resolve(num * 2);
    }, 1000);
  });
};


doubleAfterDelay(5).then((result) => console.log(result));