// console.log(document)

// 1) შექმენით საიტი რომელზეც იქნება ერთი პარაგრაფი და ერთი ღილაკი,

// დავალება არის შემდეგი: როდესაც ღილაკზე დავაწვებით უნდა შეიცვალოს პარაგრაფის ტექსტი და პარაგრაფის ფერი


// 2) შექმენით საიტი სადაც იქნება div რომლის ზომაა width:200px, height:200px და backgorund color არის წითელი და ასევე უნდა იყოს ღილაკი, თქვენი დავალებაა როდესაც ამ ღილაკს დავაწვებით, div გაიზარდოს სიგანეში და გახდეს 300 px და ასევე შეეცვალოს background-color და გახდეს მწვანე.


// 3) შექმენით counter საიტი, სადაც იქნება -1 ღილაკი, +1 ღილაკი და პარაგრაფი რომელიც იქნება 0,

// თქვენი დავალებაა, როდესაც +1 ღილაკს დავაწვებით პარაგრაფში მყოდი რიცხვი გაიზარდოს ერთით, ხოლო როცა -1 ს დავაჭერთ შემცირდეს 1 ით

const h1 = document.getElementById("par")
const button = document.querySelector("button")

button.onclick=()=>{
    h1.style.color="red"
    h1.innerHTML="hello"
}