#0)
#  1. Sequencing – მოქმედებების შესრულება რიგის მიხედვით, ნაბიჯ-ნაბიჯ.
# 2. Selection – არჩევანი პირობის მიხედვით 
# 3. Iteration / Loop – ერთი და იგივე მოქმედების განმეორება მაგალითად რამე ღილაკს რომ დააჭერ და ვიდეო რომ ისევ განმეორებით ჩაირთვება
#1)for ციკლი გამოიყენება დროის დასაზოგად მაგალითად 1-100 ხელით 100 ჯერ პრინტის დაწერა რომ არ მოუწიოს ადამიანს გამოიყენებს for ციკლს და ეგრე დაპრინტავს
#2)
for i in range(1001):
    print(i)
#3)
for i in range(15):
  print("საჭმაელი")
#4
for i in range(5):
    print("mom")
    print("dad")
    print("sister")
