// 0.
// List (Array) ინახავს ელემენტებს თანმიმდევრობით, ინდექსების მიხედვით და ნებას რთავს დუბლიკატებს.
// Set ინახავს მხოლოდ უნიკალურ ელემენტებს. მასში დუბლიკატები ავტომატურად იშლება.

// 1.
let myNumbers = new Set([5, 10, 15]);
myNumbers.add(20);
myNumbers.delete(10); 

// 2.
let myInfo = {
    firstName: "გიორგი",
    lastName: "გაბუნია",
    age: 20,
    city: "Tbilisi"
};

// 3.
// Math.round() - ამრგვალებს უახლოეს მთელამდე.
// Math.floor() - ამრგვალებს ყოველთვის ქვემოთ.
// Math.ceil() - ამრგვალებს ყოველთვის ზემოთ.
// Math.abs() - აბრუნებს რიცხვის მოდულს (დადებითს).
// Math.sign() - აბრუნებს რიცხვის ნიშანს (1, -1 ან 0).
// Math.random() - აგენერირებს შემთხვევით რიცხვს 0-დან 1-მდე.
// .length - აბრუნებს ტექსტის სიგრძეს.
// .charAt() - აბრუნებს სიმბოლოს ინდექსით (არ მუშაობს მინუსებზე).
// .at() - აბრუნებს სიმბოლოს ინდექსით (მუშაობს მინუსებზეც).
// .slice() - ჭრის სტრინგის ნაწილს.
// .toUpperCase() - ტექსტი გადაჰყავს დიდ ასოებში.
// .toLowerCase() - ტექსტი გადაჰყავს პატარა ასოებში.
// .trim() - აშორებს სფეისებს ორივე ბოლოდან.
// .trimStart() - აშორებს სფეისებს დასაწყისიდან.
// .trimEnd() - აშორებს სფეისებს ბოლოდან.
// .repeat() - იმეორებს ტექსტს მითითებულჯერ.
// .replace() - ანაცვლებს პირველ ნაპოვნ სიტყვას.
// .replaceAll() - ანაცვლებს ყველა ნაპოვნ სიტყვას.
// .split() - ყოფს სტრინგს მასივად.