// 1)შექმენი სია სადაც შეინახავთ ნებისმიერ მონაცემთა ტიპის ელემენტს, შენი დავალებაა ამოიღო სიიდან ერთი რანმომული ელემენტი და გამოიტანო კონსოლში, მინიშნება: Math.random()
let lists = ["dog", "cat"];

let randomIndex = Math.floor(Math.random() * lists.length);

let randomItem = lists[randomIndex];

console.log(randomItem);

// დავალება 2: ცვლადების შექმნა (let და const)
// ეს დავალება დაგეხმარება გაიგო სხვაობა let და const ცვლადებს შორის.

// შექმენი ცვლადი let-ის გამოყენებით შენი ასაკისთვის (მაგ: myAge) და მიანიჭე შესაბამისი რიცხვითი მნიშვნელობა.

// შექმენი ცვლადი const-ის გამოყენებით შენი დაბადების წლისთვის (მაგ: birthYear) და მიანიჭე მნიშვნელობა.

// ახლა სცადე შეცვალო myAge-ის მნიშვნელობა ახალი რიცხვით.

// გამოიტანე ორივე ცვლადი console.log()-ის დახმარებით.

// ექსპერიმენტი: სცადე კოდში შეცვალო birthYear-ის მნიშვნელობაც. დააკვირდი რა შეცდომას (Error) გამოიტანს კონსოლი, რათა დარწმუნდე, რომ const-ის (მუდმივას) გადაწერა არ შეიძლება.



// დავალება 2: მათემატიკური მინიჭების ოპერატორები.
// გამოიყენე მოკლე ჩანაწერები (+=, -=, *=, /=).

// წარმოიდგინე, რომ გაქვს საბანკო ანგარიში. შექმენი ცვლადი let balance = 100;

// ანგარიშზე ჩაგირიცხეს 50 ლარი. გაზარდე ბალანსი += ოპერატორის გამოყენებით.

// მაღაზიაში დახარჯე 30 ლარი. შეამცირე ბალანსი -= ოპერატორის გამოყენებით.

// შენი დარჩენილი ბალანსი გაორმაგდა (ბონუსი). გამოიყენე *= ოპერატორი.

// დაბეჭდე საბოლოო balance კონსოლში.



// დავალება 3: ინკრემენტი და დეკრემენტი
// გავარჯიშდი ++ და -- ოპერატორებზე.

// შექმენი ცვლადი ვიდეოს "ლაიქებისთვის": let likes = 15;

// ვიღაცამ მოიწონა ვიდეო. გაზარდე likes ზუსტად 1-ით ინკრემენტის (++) გამოყენებით.

// ვიღაცამ წაშალა თავისი ლაიქი. შეამცირე likes 1-ით დეკრემენტის (--) გამოყენებით.

// გამოიტანე შედეგი კონსოლში ყოველი მოქმედების შემდეგ.

let age = 15
const birthyear = 2010
console.log(age+1)
// birthyear = 2011
console.log(birthyear)

let balance = 100;

balance += 50;
balance -= 30;
balance *= 2;
console.log(balance)

let likes = 15;

likes++;
console.log("After like:", likes);

likes--;
console.log("After unlike:", likes);

// დავალება 4: სტრიქონების შეერთება და ინტერპოლაცია.
// ისწავლე ტექსტისა და ცვლადების ერთმანეთთან დაკავშირება ორი სხვადასხვა მეთოდით.

// შექმენი 3 ცვლადი: firstName (შენი სახელი), lastName (შენი გვარი) და city (შენი ქალაქი).

// Concatenation (+ ნიშნით): შექმენი ახალი ცვლადი greeting1 და დააკავშირე ეს ცვლადები ისე, რომ მიიღო წინადადება: "გამარჯობა, მე ვარ [სახელი] [გვარი] და ვცხოვრობ ქალაქ [ქალაქი]-ში." (არ დაგავიწყდეს სივრცეების (space) დამატება ბრჭყალებში).

// Interpolation (უკუკვოტებით `` და ${}): შექმენი ახალი ცვლადი greeting2 და ზუსტად იგივე წინადადება ააწყვე Template Literals-ის გამოყენებით.

// დაბეჭდე ორივე კონსოლში და დააკვირდი, რომელი სინტაქსი უფრო მოსახერხებელი და სუფთაა.

let firstName = "ilia"
let lastName = "gakharia"
let city = "tbilisi"
let greeting1 = "გამარჯობა, მე ვარ "+ firstName+" "+lastName+" და ვცხოვრობ ქალაქ "+city
console.log(greeting1)
let greeting2 = `გამარჯობა, მე ვარ ${firstName} ${lastName} და ვცხოვრობ ქალაქ ${city}`
console.log(greeting2)